<a href="https://colab.research.google.com/github/isophel/Pandas/blob/main/CIT_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

cit = pd.read_csv("/employees.csv")
print(cit)

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True                   NaN
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry     NaN  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [18]:
import pandas as pd
import numpy as np
rea_ = pd.read_csv("/records.csv")
print(rea_)
cit_dictionary = {"name":["david","smith","kaith","larry"],
                  "Grade":[4.6,4.7,4.8,4.9],
                  "Location":["new york","kampala","Abuja","delhi"]}
cit_dataframe = pd.DataFrame(cit_dictionary)
print(cit_dataframe,"\n")
cit_column = list(cit_dataframe)
print(cit_column)
for i in cit_column:
  print(cit_dataframe[i][2],"\n")

cit_head = rea_.head(3)
print(cit_head,"\n")
cit_cclmn = list(cit_head)
for k in cit_cclmn:
  print(cit_head[k][2])

### learning missing data in pandas

# 1. isnull 
cit_isnull = {"first Team": [200,340,250,np.nan],
              "Second Team": [np.nan,200,100,400],
              "Third Team":[150,np.nan,600,700]}
cit_dt_isnull = pd.DataFrame(cit_isnull)
print(cit_dt_isnull,"\n")


print(cit_dt_isnull.isnull(),"\n")


# 2. notnull 
#cit_notnull 

print(cit_dt_isnull.notnull())

## fillna(specifier in int)
## replace(to_repalce = none , value = none)

cit_dict = {"name":["david","smith","kaith","larry"],
                  "Grade":[4.6,4.7,4.8,4.9],
                  "Location":["new york","kampala","Abuja","delhi"]}
cit_data = pd.DataFrame(cit_dict)
cit_column2 = list(cit_data)
print(cit_column2)
for i in cit_column2:
  #print(cit_data[i][2],"\n")
  print(cit_data.replace(to_replace=cit_data[i][2],value="Mbarara"),"\n")

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        NaN
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                NaN  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                NaN   900000.0
455   Tibor Pleiss       Utah Jazz  ...                NaN  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457            NaN             NaN  ...                NaN        NaN

[458 rows x 9 columns]
    name  Grade  Location
0  david    4.6  new york
1  smith    4.7   kampala
2  kaith    4.8     Abuja
3  larry    4.9     delhi

['name', 'Grade', 'Location']
kaith

4.8

Abuja

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

John Holland
Boston Celtics
30.0
SG
27.0
6-5
205.0
Boston University
nan
   first Team  Second Team  Third Team
0       200.0          NaN       150.0
1       340.0        200.0         NaN
2       250.0        100.0       600.0
3         NaN        400.0       700.0

   first Team  Second Team  Third Team
0       False         True       False
1       False        False        True
2       False        False       False
3        True        False       False

   first Team  Second Team  Third Team
0        True        False        True
1        True         True       False
2        True         True        True
3       False         True        True
['name', 'Grade', 'Location']
      name  Grade  Location
0    david    4.6  new york
1    smith    4.7   kampala
2  Mbarara    4.8     Abuja
3    larry    4.9     delhi

    name    Grade  Location
0  david      4.6  new york
1  smith      4.7   kampala
2  kaith  Mbarara     Abuja
3  larry      4.9     delhi

    name  Grade  Location
0  david    4.6  new york
1  smith    4.7   kampala
2  kaith    4.8   Mbarara
3  larry    4.9     delhi